examples/render_all_grammars/dot/tests_functional_regressions_issue140_A.dot
    digraph xtext {
    fontname = "Bitstream Vera Sans"
    fontsize = 8
    node[
        shape=record,
        style=filled,
        fillcolor=aliceblue
    ]
    nodesep = 0.3
    edge[dir=black,arrowtail=empty]


40954152[ label="{Model|}"]

40959096[ label="{E|+name:ID\l}"]

40964040[ label="{*C|}"]

40969576[ label="{C1|+name:ID\l}"]

40975112[ label="{TXT|+txt:STRING\l}"]

40328792[ label="{ID|}"]

40273208[ label="{STRING|}"]

40695816[ label="{BOOL|}"]

40174104[ label="{INT|}"]

40201064[ label="{FLOAT|}"]

40206600[ label="{STRICTFLOAT|}"]

40936264[ label="{NUMBER|}"]

40941800[ label="{BASETYPE|}"]

40947336[ label="{*OBJECT|}"]



40954152 -> 40959096[arrowtail=diamond, dir=both, headlabel="es 1..*"]
40959096 -> 40964040[arrowtail=diamond, dir=both, headlabel="c 1..*"]
40964040 -> 40969576 [dir=back]
40969576 -> 40975112[arrowtail=diamond, dir=both, headlabel="t "]
40936264 -> 40206600 [dir=back]
40936264 -> 40174104 [dir=back]
40941800 -> 40936264 [dir=back]
40941800 -> 40201064 [dir=back]
40941800 -> 40695816 [dir=back]
40941800 -> 40328792 [dir=back]
40941800 -> 40273208 [dir=back]
40947336 -> 40941800 [dir=back]

}
